Revit 2024 API
FabricationPart.HasLining Property
 True if the fabrication part is lined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool HasLining { get; }
Visual Basic
Public ReadOnly Property HasLining As Boolean
	Get
Visual C++
public:
property bool HasLining {
	bool get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace